package main

import "fmt"

/*
1. Код должен выполнять требования
2. Код должен быть безопасным
3. Код должен быть понятным и поддерживаемым
4. Код должен быть тестируемым
5. Код должен быть эффективным и производительным
6. Код должен следовать стандартам и лучшим практикам
*/

func main() {
	a := 5 //Непонятно
	fmt.Println(a)

	catsCount := 5 //Понятно
	fmt.Println(catsCount)
	// Мораль - называть переменные осмысленно

	/*
		Название переменной:
		1. Не должно начинаться с цифры, содержать пробелы, точки, специмволы, дефисы
		2. Принято использовать нотацию camelCase
		3. Константы принято писать БОЛЬШИМИ_БУКВАМИ
	*/
}
